ML Course, Bogot√°, Colombia  (&copy; Josh Bloom; June 2019)

Breakout session: Answer some questions about San Francisco Home sales
----

Use the ``SFhousing.csv`` dataset:

----

<u>Hints:</u>
  - frequency for resampling 'M' : Monthly   
  - for mean, max, min use `apply` after resampling.

I: Read this data into a pandas dataframe. Convert the dates into the index and the dollar amounts of homesale prices ("Sale_Amount") into float values.

In [1]:
import pandas as pd
import numpy as np

Hint: your `dtypes` of the dataframe should be
```
APN              object
ADDRESS          object
Sale_Amount     float64
Num_Bedrooms      int64
BLKLOT           object
dtype: object
```

II. What were the total number of sales per month?

In [3]:
!ls data

SFHousing.csv

In [67]:
#dataf = pd.read_csv("data/SFHousing.csv", dtype={"APN": object, "ADDRESS": object, "Sale_Amount": np.float64, 
#                                                "Num_Bedrooms": np.int64, "BLKLOT": object})
dataf = pd.read_csv("data/SFHousing.csv", parse_dates=[2], index_col="Date_Sale")  # I was expecting this to parse dates, it didn't.
dataf.head()

,APN,ADDRESS,Sale_Amount,Num_Bedrooms,BLKLOT
Date_Sale,,,,,
2012-01-03,3570 101,566 SOUTH VAN NESS AVE #3,"$425,500",2,3570101
2012-01-03,3719 181,301 MISSION ST #22E,"$1,160,000",2,3719181
2012-01-03,8704 277,300 BERRY ST # 1612,"$774,025",2,8704277
2012-01-04,1836 032,1463 17TH AVE,"$660,000",2,1836032
2012-01-04,3594 079,3380 20TH ST 302,"$450,000",2,3594079

In [68]:
# Converting string with dollar sign to float
dataf["Sale_Amount"] = dataf["Sale_Amount"].str.replace("$","")
# Remove commas and change type to float64
dataf["Sale_Amount"] = dataf["Sale_Amount"].str.replace(",","").astype(np.float64)

In [71]:
dataf.dtypes

APN              object
ADDRESS          object
Sale_Amount     float64
Num_Bedrooms      int64
BLKLOT           object
dtype: object

In [72]:
#dataf.set_index("Date_Sale", inplace=True)
dataf.head()

,APN,ADDRESS,Sale_Amount,Num_Bedrooms,BLKLOT
Date_Sale,,,,,
2012-01-03,3570 101,566 SOUTH VAN NESS AVE #3,425500.0,2,3570101
2012-01-03,3719 181,301 MISSION ST #22E,1160000.0,2,3719181
2012-01-03,8704 277,300 BERRY ST # 1612,774025.0,2,8704277
2012-01-04,1836 032,1463 17TH AVE,660000.0,2,1836032
2012-01-04,3594 079,3380 20TH ST 302,450000.0,2,3594079

In [74]:
# Resample by month "M" and count... wow!
dataf["Sale_Amount"].resample("M").count()

Date_Sale
2012-01-31     68
2012-02-29     82
2012-03-31    105
2012-04-30    125
2012-05-31    137
2012-06-30    146
2012-07-31    100
2012-08-31    176
2012-09-30    104
2012-10-31     73
2012-11-30     49
2012-12-31      2
Freq: M, Name: Sale_Amount, dtype: int64

III. What was the average, min and max housing price per month?

In [75]:
dataf["Sale_Amount"].resample("M").apply(lambda x: [x.mean(), x.min(), x.max()])

Date_Sale
2012-01-31                [786415.25, 1500.0, 2004000.0]
2012-02-29       [743212.0365853659, 92500.0, 2750000.0]
2012-03-31       [852983.1428571428, 10000.0, 2515000.0]
2012-04-30              [873141.256, 29000.0, 3800000.0]
2012-05-31     [1041000.9854014599, 245000.0, 4750000.0]
2012-06-30      [850681.0547945206, 208000.0, 1998000.0]
2012-07-31             [1073750.65, 208000.0, 6000000.0]
2012-08-31    [2013070.7215909092, 208000.0, 16600000.0]
2012-09-30            [1084000.875, 119000.0, 5100000.0]
2012-10-31      [963303.2602739726, 208000.0, 3500000.0]
2012-11-30      [982842.9591836735, 430000.0, 2200000.0]
2012-12-31             [1867500.0, 1800000.0, 1935000.0]
Freq: M, Name: Sale_Amount, dtype: object

IV. (bonus) What was the average housing price for all houses sold over $100,000?

In [79]:
dataf[dataf["Sale_Amount"] > 100000]["Sale_Amount"].mean()

1100238.4706896553